---
layout: base
---

<script type="text/javascript">
 lexemeSparql = `
# Data for a specific character
SELECT DISTINCT
  ?description
  (?valueLabel AS ?value_) ?value_Url
  ?source ?sourceUrl
WHERE {
  VALUES ?character { wd:${ q } }
  {
    BIND(1 AS ?order)
    BIND("Label" AS ?description)
    ?character rdfs:label ?value .
	FILTER (LANG(?value) = 'en')
    BIND(?value AS ?valueLabel)
  }
  UNION 
  {
    BIND(2 AS ?order)
    BIND("Script" AS ?description)
    ?character wdt:P282 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../script?q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel)) AS ?value_Url)
  }
  UNION 
  {
    BIND(4 AS ?order)
    BIND("Instance of" AS ?description)
    ?character p:P31 ?value_statement .
    ?value_statement ps:P31 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../property_value?p=P31&q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P248 ?source_ .
      ?source_ rdfs:label ?source .
      FILTER (LANG(?source) = 'en')
      BIND(CONCAT("../reference?q=", SUBSTR(STR(?source_), 32),"&qLabel=",STR(?source))  AS ?sourceUrl)
    }
  }
  UNION 
  {
    # Homographs
    BIND(16 AS ?order)
    BIND("Time Periods" AS ?description)
    ?character wdt:P2348 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../q?q=",SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
  }
  UNION 
  {
    BIND(18 AS ?order)
    BIND("Compound" AS ?description)
    ?character wdt:P527 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = "en")
    BIND(CONCAT("../c?q=",SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
	FILTER (?value != wd:${ q })
  }
  UNION 
  {
    BIND(20 AS ?order)
    BIND("Described in" AS ?description)
    ?character ontolex:lexicalForm? / p:P1343 ?value_statement .
    ?value_statement ps:P1343 ?value .
    ?value rdfs:label ?valueLab .
	OPTIONAL{?value_statement pq:P1810 ?valuenum .}
	OPTIONAL{?value_statement pq:P7421 ?refline .}
	OPTIONAL{?value_statement pq:P304 ?refpage .}
	BIND(COALESCE(?valuenum, "") As ?thenum)
	BIND(COALESCE(CONCAT("p. ",?refpage), "") As ?thepage)
	BIND(COALESCE(CONCAT("l. ",?refline), "") As ?theline)
	BIND(CONCAT(?thenum,?thepage,?theline) AS ?refnumber)
    FILTER (LANG(?valueLab) = 'en')
    BIND(CONCAT(?valueLab," [",?refnumber,"]") AS ?valueLabel)
    BIND(CONCAT("../reference?q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P854 ?sourceUrl .
      BIND("↗" AS ?source)
    }
  }
}
ORDER BY ?order
`

 formsSparql = `
 # List of variants for a specific character
 SELECT
   ?form (GROUP_CONCAT(?timeperiodLab; separator=" // ") AS ?timeperiod)
   ?formLabel ?gottstein_code ?image (GROUP_CONCAT(distinct ?form; separator=" ") AS ?image_link)
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   ?form wdt:P180 wd:${ q } .
   ?form wdt:P31 wd:Q118867680 .
   OPTIONAL {?form wdt:P18 ?image .}
   OPTIONAL {?form wdt:P2348 ?timeperiod . ?timeperiod rdfs:label ?timeperiodLab . FILTER (LANG(?timeperiodLab) = "en")}
   OPTIONAL {?form wdt:P11957 ?gottstein_code .}
   OPTIONAL {
     ?form rdfs:label ?formLabel .
     FILTER (LANG(?formLabel) = "en")
   }
 }
 GROUP BY ?form ?formLabel ?image ?gottstein_code
 ORDER BY (STR(?form))
 `

 sensesSparql = `
# List of senses for a specific lexeme
 SELECT
  ?sense ?senseLab
  (GROUP_CONCAT(?gloss; separator=" // ") AS ?senseLabel)
  (IRI(CONCAT("https://commons.wikimedia.org/w/index.php?title=Special:Redirect/file&width=200&wpvalue=", 
          SUBSTR(STR(SAMPLE(?images)), 52))) AS ?sense_image)
 WHERE {
   wd:${ q } wdt:P180 ?sense .
   BIND(SUBSTR(STR(?sense), 32) AS ?senseLab)
   ?sense rdfs:label ?gloss .
   FILTER(LANG(?gloss)="en")
 }
 GROUP BY ?sense ?senseLab
 ORDER BY (STR(?sense))
`


readingsSparql = `
SELECT ?lexeme ?lexemeLabel (GROUP_CONCAT(?rep; separator=" // ") AS ?reps) WHERE {		       
  wd:${ q } rdfs:label ?charlabel .
  ?lexeme rdf:type ontolex:LexicalEntry ;          
     dct:language wd:Q36790 ;		   
     wikibase:lemma ?lexemeLabel  .  
   OPTIONAL {?lexeme ontolex:lexicalForm ?lf . ?lf ontolex:representation ?rep .}           
   FILTER(lang(?charlabel)="en")
   FILTER(STR(?lexemeLabel)=STR(?charlabel))
}
GROUP BY ?lexeme ?lexemeLabel
ORDER BY ?lexeme
`

usedinLexemeSparql=`
SELECT ?lexeme ?lexemeLabel ?sense (GROUP_CONCAT(?senselabel; separator=" // ") AS ?senseLabel) WHERE {		       
  wd:${ q } rdfs:label ?charlabel .
  ?lexeme rdf:type ontolex:LexicalEntry ;          
     dct:language wd:Q36790 ;		   
     wikibase:lemma ?lexemeLabel  .   
   OPTIONAL {?lexeme ontolex:sense ?sense . ?sense wdt:P5137 ?senseval . 
   OPTIONAL {?senseval rdfs:label ?senselabel . FILTER(LANG(?senselabel)= "en") }}	 
   FILTER(lang(?charlabel)="en")
   FILTER(contains(?lexemeLabel,?charlabel))
}
GROUP BY ?lexeme ?lexemeLabel ?sense
ORDER BY ?lexeme
`


 $(document).ready(function() {
     sparqlToDataTable(lexemeSparql, "#lexeme",
		       options={
			   linkPrefixes: {
			       source: '../reference',
				   value_Url: '../'
			   },
			   paging: false,
			   sDom: 'rt',
		       });
     sparqlToDataTable(formsSparql, "#forms",
		       options={			   
			   linkPrefixes: {
			       form: '../cf'
			   },
			   linkParams: {
			       form: '&qb='+q
			   },
			   paging: false, sDom: 'rt',});
     sparqlToDataTable(sensesSparql, "#senses",
		       options={paging: false, sDom: 'rt',});
     sparqlToDataTable(readingsSparql, "#readings",
		       options={paging: true, sDom: 'rt',});
     sparqlToDataTable(usedinLexemeSparql, "#usedlexemes",
		       options={paging: true, sDom: 'rt',linkPrefixes: {
			       lexeme: '../l',
			       sense: '../ls'
			   }});
 });

</script>

 <div class="l-entry">

     <h1>Character: ${ qLabel } (${ q })</h1>
     
     
     <p>
         <a title="Back"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="../script?q=${ qb }">←</a>
	 <a title="View and edit lexeme in Wikidata"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="https://www.wikidata.org/wiki/${ q }">Wikidata ↗</a>
     </p>
     
     <table class="table table-hover" id="lexeme"></table>
     
     <div class="container">
	 <div class="row">
	    <div class="col-12 col-lg-12">
		  <table class="table table-hover" id="forms"></table>
	    </div>

	 </div>
	 <div class="row">
	 	<div class="col-12 col-lg-12">
		  <table class="table table-hover" id="senses"></table>
	      </div>
	 </div>
     </div>

    <hr/>
    
    <!--<h2>Compounds</h2>

    <table class="table table-hover" id="compounds"></table>-->

    <h2>Compound and derivation graph</h2>
    
    <div class="embed-responsive embed-responsive-4by3">
	
<iframe style="width: 80vw; height: 75vh; border: none;" src="https://query.wikidata.org/embed.html#%23%20Show%20compound%20hierarchy%0A%23defaultView%3AGraph%0ASELECT%20%3Flexeme%20%3FlexemeLabel%20%3Fcompound%20(GROUP_CONCAT(%3FcompoundLab%3B%20separator%3D%22%20%2F%2F%20%22)%20AS%20%3FcompoundLabel)%0A%20%20%20%20WHERE%20%7B%0A%09%20%20BIND(wd%3A${ q }%20AS%20%3Flexeme)%0A%20%20%20%20%20%20%3Flexeme%20rdfs%3Alabel%20%3FlexemeLabel%20.%0A%09%20%20%7B%0A%20%20%20%20%20%20%20%20%3Flexeme%20wdt%3AP527%20%3Fcompound.%0A%20%20%20%20%20%20%20%20OPTIONAL%20%7B%0A%20%20%20%20%20%20%20%20%20%20%3Fcompound%20rdfs%3Alabel%20%3FcompoundLab%20.%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(LANG(%3FcompoundLab)%20%3D%20%22en%22)%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(%3Fcompound%20!%3D%20wd%3A${ q })%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%7DUNION%20%7B%0A%20%20%20%20%20%20%20%20%3Fcompound%20wdt%3AP527%20%3Flexeme%20.%0A%20%20%20%20%20%20%20%20OPTIONAL%20%7B%0A%20%20%20%20%20%20%20%20%20%20%3Fcompound%20rdfs%3Alabel%20%3FcompoundLab%20.%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(LANG(%3FcompoundLab)%20%3D%20%22en%22)%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(%3Fcompound%20!%3D%20wd%3A${ q })%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%7D%0A%20%20%20%20GROUP%20BY%20%3Flexeme%20%3Fcompound%20%3FlexemeLabel" referrerpolicy="origin" sandbox="allow-scripts allow-same-origin allow-popups" ></iframe>

</div>
    <h2>Readings</h2>

    <table class="table table-hover" id="readings"></table>

    <h2>Used in lexemes</h2>

    <table class="table table-hover" id="usedlexemes"></table>
    
</div>


