---
layout: base
---

<script type="text/javascript">
 lexemeSparql = `
# Data for a specific character
SELECT DISTINCT
  ?description
  (?valueLabel AS ?value_) ?value_Url
  ?source ?sourceUrl
WHERE {
  VALUES ?character { wd:${ q } }
  {
    BIND(1 AS ?order)
    BIND("Label" AS ?description)
    ?character rdfs:label ?value .
	FILTER (LANG(?value) = 'en')
    BIND(?value AS ?valueLabel)
  }
  UNION 
  {
    BIND(2 AS ?order)
    BIND("Script" AS ?description)
    ?character wdt:P282 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("script?q=", SUBSTR(STR(?value), 32)) AS ?value_Url)
  }
  UNION 
  {
    BIND(4 AS ?order)
    BIND("Instance of" AS ?description)
    ?character p:P31 ?value_statement .
    ?value_statement ps:P31 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("property_value?p=P31&q=", SUBSTR(STR(?value), 32))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P248 ?source_ .
      ?source_ rdfs:label ?source .
      FILTER (LANG(?source) = 'en')
      BIND(CONCAT("reference?q=", SUBSTR(STR(?source_), 32))  AS ?sourceUrl)
    }
  }
  UNION 
  {
    # Homographs
    BIND(16 AS ?order)
    BIND("Time Periods" AS ?description)
    ?character wdt:P2348 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = 'en')
    BIND(SUBSTR(STR(?value), 32)  AS ?value_Url)
  }
  UNION 
  {
    BIND(18 AS ?order)
    BIND("Compound" AS ?description)
    ?character wdt:P527 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = "en")
    BIND(SUBSTR(STR(?value), 32)  AS ?value_Url)
	FILTER (?value != wd:${ q })
  }
  UNION 
  {
    BIND(20 AS ?order)
    BIND("Described in" AS ?description)
    ?character ontolex:lexicalForm? / p:P1343 ?value_statement .
    ?value_statement ps:P1343 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("reference?q=", SUBSTR(STR(?value), 32))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P854 ?sourceUrl .
      BIND("↗" AS ?source)
    }
  }
}
ORDER BY ?order
`

 formsSparql = `
 # List of variants for a specific character
 SELECT
  ?form ?formLabel
   (GROUP_CONCAT(DISTINCT ?featureLabel; separator=" // ") AS ?features)
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   wd:${ q } wdt:P8530 ?form .
   ?form rdfs:label ?formLabel .
   OPTIONAL {
     ?form wikibase:grammaticalFeature ?feature .
     ?feature rdfs:label ?featureLabel .
     FILTER (LANG(?featureLabel) = "en")
   }
 }
 GROUP BY ?form ?formLabel
 ORDER BY (STR(?form))
 `

 sensesSparql = `
# List of senses for a specific lexeme
 SELECT
  ?sense ?senseLabel
  (GROUP_CONCAT(?gloss; separator=" // ") AS ?glosses)
  (IRI(CONCAT("https://commons.wikimedia.org/w/index.php?title=Special:Redirect/file&width=200&wpvalue=", 
          SUBSTR(STR(SAMPLE(?images)), 52))) AS ?sense_image)
 WHERE {
   wd:${ q } wdt:P180 ?sense .
   BIND(SUBSTR(STR(?sense), 32) AS ?senseLabel)
   ?sense rdfs:label ?gloss .
 }
 GROUP BY ?sense ?senseLabel
 ORDER BY (STR(?sense))
`


 compoundsSparql = `
SELECT ?lexeme ?compound (GROUP_CONCAT(?compoundLabel; separator=" // ") AS ?other_compounds)
    WHERE {
      wd:${ q } wdt:P527 ?compound.
      OPTIONAL {
        ?compound rdfs:label ?compoundLabel .
        FILTER (LANG(?compoundLabel) = "en")
        FILTER (?compound != wd:Q87556731)
      }
    }
    GROUP BY ?lexeme ?compound  
`


 $(document).ready(function() {
     sparqlToDataTable(lexemeSparql, "#lexeme",
		       options={
			   linkPrefixes: {
			       source: '../reference',
				   value_Url: '../'
			   },
			   paging: false,
			   sDom: 'rt',
		       });
     sparqlToDataTable(formsSparql, "#forms",
		       options={paging: false, sDom: 'rt',});
     sparqlToDataTable(sensesSparql, "#senses",
		       options={paging: false, sDom: 'rt',});
     sparqlToDataTable(compoundsSparql, "#compounds",
		       options={paging: false, sDom: 'rt',});
 });

</script>

 <div class="l-entry">

     <h1>Time Period: ${ q }</h1>
     
     
     <p>
         <a title="Back"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="../script?q=${ qb }">←</a>
	 <a title="View and edit lexeme in Wikidata"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="https://www.wikidata.org/wiki/${ q }">Wikidata ↗</a>
     </p>
     
     <table class="table table-hover" id="lexeme"></table>
     
     <div class="container">
	 <div class="row">
	      <div class="col-12 col-lg-6">
		  <table class="table table-hover" id="forms"></table>
	      </div>
	      <div class="col-12 col-lg-6">
		  <table class="table table-hover" id="senses"></table>
	      </div>
	 </div>
     </div>

    <hr/>
    
    <h2>Compounds</h2>

    <table class="table table-hover" id="compounds"></table>

    <h2>Compound and derivation graph</h2>
    
    <div class="embed-responsive embed-responsive-4by3">
      <iframe loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23%20Show%20compound%20and%20derivation%20hierarchy%0A%23defaultView%3AGraph%0ASELECT%20DISTINCT%0A%20%20%3Flexeme1%20%3Flexeme1Label%20%3Flexeme1Image%0A%20%20%3Flexeme2%20%3Flexeme2Label%20%3Flexeme2Image%0A%7B%0A%20%20hint%3AQuery%20hint%3Aoptimizer%20%22None%22.%0A%20%20VALUES%20%3Flexeme%20%7B%20wd%3A${ q }%20%7D%0A%20%20%7B%0A%20%20%20%20%3Flexeme%20%28wdt%3AP5238%20%7C%20wdt%3AP5191%29%2B%20%7C%20%28%5Ewdt%3AP5238%20%7C%20%5Ewdt%3AP5191%29%2B%20%3Flexeme1%20%2C%20%3Flexeme2%20.%20%0A%20%20%20%20%3Flexeme1%20wdt%3AP5238%20%7C%20wdt%3AP5191%20%3Flexeme2%20.%0A%20%20%7D%0A%20%20UNION%0A%20%20%7B%0A%20%20%20%20BIND%28%3Flexeme%20AS%20%3Flexeme1%29%0A%20%20%20%20%3Flexeme%20wdt%3AP5238%20%7C%20wdt%3AP5191%20%3Flexeme2%20.%0A%20%20%7D%0A%20%20UNION%0A%20%20%7B%0A%20%20%20%20BIND%28%3Flexeme%20AS%20%3Flexeme2%29%0A%20%20%20%20%3Flexeme1%20wdt%3AP5238%20%7C%20wdt%3AP5191%20%3Flexeme%20.%0A%20%20%7D%0A%20%20OPTIONAL%20%7B%20%3Flexeme1%20ontolex%3Asense%20%2F%20wdt%3AP5137%3F%20%2F%20wdt%3AP18%20%3Flexeme1Image%20%7D%0A%20%20OPTIONAL%20%7B%20%3Flexeme2%20ontolex%3Asense%20%2F%20wdt%3AP5137%3F%20%2F%20wdt%3AP18%20%3Flexeme2Image%20%7D%0A%20%20%3Flexeme1%20wikibase%3Alemma%20%3Flexeme1Label%20.%0A%20%20%3Flexeme2%20wikibase%3Alemma%20%3Flexeme2Label%20.%0A%7D%0ALIMIT%20500"></iframe>
  </div>


    
</div>


